/* Этапы жизненного цикла проекта
1. Выработка требований
2. Планирование
3. Разработка архитектуры - архитектор(классы на высоком уровне)
4. Детальное поектирование - программные инженеры
5. Кодирование и отладка - разработчики
6. Блочное тестирование - поиск логических ошибок в модуле - тестировщики (через boost unit test, google test)
7. Интеграционное тестирование - всей системы в целом - тоже тестировщики
8. Бета-тестирование (alphe, beta, gamma, prodaction - версии)
9. Внедрение
10. Поддержка
11. Вывод из эксплуатации

GIT - система контроля версий (аналоги - Mercurial, SVN)

*/

#include <iostream>

int main()
{

	return EXIT_SUCCESS;
}